---
kind: other
id: Methods.T:Autodesk.Revit.DB.CurtainSystem
source: html/a1811460-b84f-52fc-0c54-4e5be7809d51.htm
---
# CurtainSystem Methods

Add CurtainGrid on the specified face for the CurtainSystem.